In [1]:
import pandas as pd
import glob

In [14]:
pattern = 'data/*.csv'
csv_files = glob.glob(pattern)

In [16]:
pattern1 = 'data/Course ID/*.csv'
cols2add = glob.glob(pattern1)
cols2add

['data/Course ID\\0 - index_01_5621.csv',
 'data/Course ID\\1 - index_5621_5945.csv',
 'data/Course ID\\2 - index_5945_10000.csv',
 'data/Course ID\\3 - index_10000_15000.csv',
 'data/Course ID\\4 - index_15000_20000.csv',
 'data/Course ID\\5 - index_20000_23000.csv',
 'data/Course ID\\6 - index_23000_end.csv']

In [4]:
frames = []
for csv in csv_files:
    df = pd.read_csv(csv)
    frames.append(df)

reviews = pd.concat(frames).drop(['Unnamed: 0', 'course_id', 'course_name'],axis=1)

In [24]:
frames = []
for cols in cols2add:
    df = pd.read_csv(cols)
    frames.append(df)
    
course_id = pd.concat(frames).drop(['Unnamed: 0', 'review_id'], axis = 1)

In [11]:
reviews.head()

,review_id,review_date,review_text,agree_score,disagree_score,funny_score,professor_id,professor_name
0,5,12/31/1999 0:00,\r\nThinking about taking this class because y...,0,10,0,8.0,"Shapiro, Jill"
1,6,12/31/1999 0:00,\r\nD'Altroy has the skill of taking an intere...,0,1,0,9.0,"D'Altroy, Terence"
2,7,12/31/1999 0:00,\r\nTerry D'Altroy is not really a bad profess...,0,0,0,9.0,"D'Altroy, Terence"
3,8,12/31/1999 0:00,\r\nSince 'Anthrop' does end in 'ology' this c...,0,3,0,10.0,"Cords, Marina"
4,9,12/31/1999 0:00,\r\nThis monkey class is so awful. Be prepared...,1,4,0,10.0,"Cords, Marina"

In [30]:
reviews.shape

(25569, 8)

In [35]:
#course_id.review_id = course_id.review_id.apply(int)
course_id.head()

   course_id                                        course_name
0        5.0  [EEEB V1010] The Human Species: Its Place in N...
1     3379.0                         [C1010] University Writing
2     3379.0                         [C1010] University Writing
3        7.0  [V1011/W3011] Behavioral Biology of the Living...
4        7.0  [V1011/W3011] Behavioral Biology of the Living...

In [27]:
course_id.shape

(25569, 2)

In [39]:
df = reviews.join(course_id)

In [52]:
df.to_csv('dataframe.csv')